<details><summary>apply for dev-ec2 2024-06-05 15:36:03 (UTC)</summary>
    <details><summary>Locking successful</summary>
  Project diggerhq/demo-ee-features#dev-ec2 has been locked by PR #1
</details>

<details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # aws_ssm_parameter.foo will be created
  + resource "aws_ssm_parameter" "foo" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/dev/ec2"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
aws_ssm_parameter.foo: Creating...
aws_ssm_parameter.foo: Creation complete after 0s [id=/dev/ec2]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```
</details>

</details>